[
  {
    "LanguageEntryId": 8,
    "Name": "Basic",
    "Key": "vb",
    "BaseYear": 1979,
    "IsEstimate": false,
    "Text": "\u003Cb\u003EBasic\u003C/b\u003E was the first programming language I learned and over the years I worked in several different versions of it: \n\u003Cul\u003E\n\u003Cli\u003EI discovered \u003Cb\u003EVisual Basic\u003C/b\u003E in the early 90\u0027s shortly after \u003Cb\u003EVB 1.0\u003C/b\u003E was released. It was pretty revolutionary for the time and to me it seemed like a more realistic variant of the concept that HyperCard on the Mac had introduced years before. It was also my first introduction to object-oriented programming concepts, although it wasn\u0027t obvious at the time. At that time programming was more of a hobby than anything else and I wrote a lot of small desktop utilities such as calculators, music library trackers and phone books (one advantage of using a modem is that you can dial out programmaticly).\n\u003Cspace\u003E\nLater on, after switching careers to a full-time developer, I ran into \u003Cb\u003EVB 5/6\u003C/b\u003E as it was used to create executables and DLLs that would be used as COM objects for ASP pages. Corillian made heavy use of the COM objects, as did IAG, where I wrote an installer for their product in VB6. However, most of the server-side objects at IAG were written in VB.Net and instantiated as services using a third-party product. Merrill Corporation had a lot of legacy code written in VB6 which I ended up supporting and modifying when necessary. They were (probably still are) in the process of replacing those applications with something a little more current.\n\u003C/li\u003E\n\u003Cli\u003EI discovered \u003Cb\u003EActive Server Pages (ASP)\u003C/b\u003E in the late 90\u0027s (1998-ish?). Up until then, I had been creating websites using HTML and Perl, mostly for my local service provider (Genesis systems in San Dimas California). I was beginning to do some web development informally at McDonnell Douglas, mostly on my department\u0027s internal intranet site but mostly at that time web development for me was still a hobby with a mix of freelance work for small companies and churches.\n\u003Cspace\u003E\nThat all changed when I moved my family to Oregon in 2000 and took a full-time job as a web developer at Corillian Corporation (acquired by Fiserv in 2007) in Beaverton. There I worked mostly in JavaScript on the front end and VBScript in the ASP pages in developing online banking sites. There was also a custom version of Basic that was used in their host scripts to communicate with the various bank\u0027s back-ends, usually accomplished by screen-scraping virtual displays generated by a mainframe.\n\u003Cspace\u003E\nAfter being laid ff from Corillian in 2004, I went to work with Innovation Asset Group, a start-up in Lake Oswego. There I continued working in ASP on their line-of-business web application, Decipher. Interestingly they were using VBScript as the scripting language in the client as well which restricted it\u0027s use to Internet Explorer only. On the rewrite of the application a few years later, we converted to JavaScript on the client so that the app would work on all browsers. \n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003EIBM/PC Basic.\u003C/b\u003E\nIn 1991 I bought my first PC. It was a no-name 386DX full tower I had built in one of the local computer shops that were common at that time. It of course had \u003Cb\u003EGW-Basic\u003C/b\u003E but I switched to \u003Cb\u003EQuickBASIC\u003C/b\u003E when it became available. At this time most of my work in basic was just for my personal enjoyment and experimentation.\n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003ECommodore Amiga\u003C/b\u003E This was the first serious computer I owned and I worked with two flavors of Basic on it: AmigaBasic and HiSoft Basic (a compiled version of Basic for the Amiga). The Amiga was one of the first computers to have a graphical user interface (and it was in color \u0026#150; the Mac at this time was limited to black and white)\n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003ECommodore 64s\u003C/b\u003E Like many machines of it\u0027s day, it used Basic as it\u0027s native operating system. I owned several during the early 80\u0027s - lost track of how many - one would break and I\u0027d buy another at Toys R Us. I had a floppy disk drive, monitor and a printer. Wrote a rudimentary word processor that I used through my senior year of college.\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003EA Timex Sinclair 1000\u003C/b\u003E with 3Kb of memory. I used a cassette tape recorder to save and load programs. It used BASIC as it\u0027s native operating system.\u003C/li\u003E\n\u003Cli\u003EMy introduction to computer programming was in the Army, about six months before my discharge. I was working as the Brigade Draftsman and shared an office with the \u003Cb\u003EIBM 1500 Minicomputer\u003C/b\u003E that was used to generate reports and run the data used in some of the brigade\u0027s war games. I was friends with the operator and I was able to get time regularly on the machine to get a good introduction to BASIC, which like many computers of that time was acting as the machine\u0027s operating system. Initially, programming looked a lot like math to me and I really didn\u0027t thinks I would like it, but once I got the gist of it, it became a life-long obsession. I was hooked.\u003C/li\u003E\n\u003Cul\u003E"
  },
  {
    "LanguageEntryId": 1,
    "Name": "JavaScript",
    "Key": "javascript",
    "BaseYear": 1997,
    "IsEstimate": true,
    "Text": "JavaScript was my hands-down favorite language for web development. I used it on  a daily basis since the late 90s and I still haven\u0027t found anything that comes close. It supports object-oriented programming, allows variables to hold pretty much anything and handles arrays in ways that truly inspires weird and wonderful things. Using JavaScript to make AJAX calls and dynamically update portions of the page is one of my favorite techniques. Add JQuery and JSON into the mix, and nearly anything is possible."
  },
  {
    "LanguageEntryId": 3,
    "Name": "ASP (Classic)",
    "Key": "asp",
    "BaseYear": 1998,
    "IsEstimate": true,
    "Text": "I have been using ASP since the late 90s. first in freelance work, then for Boeing. When I went to work for Corillian in 2000, it became part of my day-to-day job and and remained so for fourteen years. Initially I used VBScript as the server-side language, and JavaScript as the client-side language, but I soon discovered that ASP supports JScript on the server as well and  it became my language of choice whenever possible. When I went to work for the Innovation Asset Group (IAG) in 2004"
  },
  {
    "LanguageEntryId": 9,
    "Name": "SQL",
    "Key": "sql",
    "BaseYear": 1998,
    "IsEstimate": false,
    "Text": "Not sure exactly when I started using SQL. I know it was probably around 1998 as I was still in California doing development on a Linux server for some local websites. At that time I was doing a lot of PHP/MySQL.\n\u003Cp\u003E\nWhen I went to work at Corillian in 2000, I wrote a lot of scripts against Microsoft SQL Server databases, mostly to support development. \n\u003Cp\u003E\nAt Innovation Asset Group (IAG) the emphasis was to write generic scripts that would work on both MySQL and MS Server as the main product, Decipher, could be installed to use either database engine. IAG didn\u0027t have a dedicated DB Analyst, so I ended up doing a lot of database installs and configuration.\n\u003Cp\u003E\nAt Merrill Corp. I created and edited a lot of stored procedures which were used in the legacy product and the file interfaces to pull data from customer-provided text files and save it to the database. The product dealt with large volumes of insurance data and I often had to find ways to optimize the stored procedures to improve performance."
  },
  {
    "LanguageEntryId": 2,
    "Name": "C#",
    "Key": "c",
    "BaseYear": 2002,
    "IsEstimate": true,
    "Text": "I first learned C on the Amiga, and once \u0022I got it\u0022 (it took a class at Sun Micorsystems before I really understood pointers), I was hooked. I did some C on Sun workstations at McDonnell Douglas – the Interleaf Publish System used LISP as it\u0027s scripting language (don\u0027t get me started on LISP) and all I learned in LISP was how to write a function to call a C program. After that, I made all my scripts in C. When I moved to Windows, however, C and the MFC was just to involved for what I needed it for, so I moved to other languages like Visual Basic, JavaScript, PERL and PHP."
  },
  {
    "LanguageEntryId": 4,
    "Name": "AJAX",
    "Key": "ajax",
    "BaseYear": 2006,
    "IsEstimate": true,
    "Text": "AJAX (Asynchronous JavaScript And Xml) has actually lived up to all the hype it recieved. It basically takes advantage of the XML DOM\u0027s abilty to load external files through HTTP. In practical terms, you can write a client-side function that pulls data from a server without making a round-trip to the server. (Actually it does make a round trip, but as far as your web page is concerned, it was a client-side call).\n\u003Cp\u003E\nThe name is actually a bit deceptive. AJAX is an acronym for Asynchronous Javascript And XML, however AJAX calls do not have to be asynchronous (your code does not wait for the result), nor does it have to return XML, and it can be done in a language other than JavaScript – I originally used the technique in server-side VB at Corillian to retrieve check images and online banking statements via SOAP calls over a VPN. "
  },
  {
    "LanguageEntryId": 7,
    "Name": "Entity Framework (EF)",
    "Key": "ef",
    "BaseYear": 2014,
    "IsEstimate": false,
    "Text": "First exposed to Entity Framework (EF) when I worked at Genesys "
  },
  {
    "LanguageEntryId": 6,
    "Name": "TypeScript",
    "Key": "typescript",
    "BaseYear": 2016,
    "IsEstimate": false,
    "Text": "SWBC uplifted their legacy applications to a new set of applications using .Net MVC on the back-end and Angular on the front end. This product was heavy on TypeScript in the front end and using AJAX calls to organize user input and pass the data back to the server."
  },
  {
    "LanguageEntryId": 5,
    "Name": "Blazor",
    "Key": "blazor",
    "BaseYear": 2020,
    "IsEstimate": false,
    "Text": "The latest language I\u0027ve picked up"
  }
]