[
  {
    "LanguageEntryId": 8,
    "Name": "Basic",
    "Key": "vb",
    "BaseYear": 1979,
    "IsEstimate": false,
    "Text": "\u003Cb\u003EBasic\u003C/b\u003E was the first programming language I learned and over the years I worked in several different versions of it: \n\u003Cul\u003E\n\u003Cli\u003EI discovered \u003Cb\u003EVisual Basic\u003C/b\u003E in the early 90\u0027s shortly after \u003Cb\u003EVB 1.0\u003C/b\u003E was released. It was pretty revolutionary for the time and to me it seemed like a more realistic variant of the concept that HyperCard on the Mac had introduced years before. It was also my first introduction to object-oriented programming concepts, although it wasn\u0027t obvious at the time. At that time programming was more of a hobby than anything else and I wrote a lot of small desktop utilities such as calculators, music library trackers and phone books (one advantage of using a modem is that you can dial out programmaticly).\n\u003Cspace\u003E\nLater on, after switching careers to a full-time developer, I ran into \u003Cb\u003EVB 5/6\u003C/b\u003E as it was used to create executables and DLLs that would be used as COM objects for ASP pages. Corillian made heavy use of the COM objects, as did IAG, where I wrote an installer for their product in VB6. However, most of the server-side objects at IAG were written in VB.Net and instantiated as services using a third-party product. Merrill Corporation had a lot of legacy code written in VB6 which I ended up supporting and modifying when necessary. They were (probably still are) in the process of replacing those applications with something a little more current.\n\u003C/li\u003E\n\u003Cli\u003EI discovered \u003Cb\u003EActive Server Pages (ASP)\u003C/b\u003E in the late 90\u0027s (1998-ish?). Up until then, I had been creating websites using HTML and Perl, mostly for my local service provider (Genesis systems in San Dimas California). I was beginning to do some web development informally at McDonnell Douglas, mostly on my department\u0027s internal intranet site but mostly at that time web development for me was still a hobby with a mix of freelance work for small companies and churches.\n\u003Cspace\u003E\nThat all changed when I moved my family to Oregon in 2000 and took a full-time job as a web developer at Corillian Corporation (acquired by Fiserv in 2007) in Beaverton. There I worked mostly in JavaScript on the front end and VBScript in the ASP pages in developing online banking sites. There was also a custom version of Basic that was used in their host scripts to communicate with the various bank\u0027s back-ends, usually accomplished by screen-scraping virtual displays generated by a mainframe.\n\u003Cspace\u003E\nAfter being laid ff from Corillian in 2004, I went to work with Innovation Asset Group, a start-up in Lake Oswego. There I continued working in ASP on their line-of-business web application, Decipher. Interestingly they were using VBScript as the scripting language in the client as well which restricted it\u0027s use to Internet Explorer only. On the rewrite of the application a few years later, we converted to JavaScript on the client so that the app would work on all browsers. \n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003EIBM/PC Basic.\u003C/b\u003E\nIn 1991 I bought my first PC. It was a no-name 386DX full tower I had built in one of the local computer shops that were common at that time. It of course had \u003Cb\u003EGW-Basic\u003C/b\u003E but I switched to \u003Cb\u003EQuickBASIC\u003C/b\u003E when it became available. At this time most of my work in basic was just for my personal enjoyment and experimentation.\n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003ECommodore Amiga\u003C/b\u003E This was the first serious computer I owned and I worked with two flavors of Basic on it: AmigaBasic and HiSoft Basic (a compiled version of Basic for the Amiga). The Amiga was one of the first computers to have a graphical user interface (and it was in color \u0026#150; the Mac at this time was limited to black and white)\n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003ECommodore 64s\u003C/b\u003E Like many machines of it\u0027s day, it used Basic as it\u0027s native operating system. I owned several during the early 80\u0027s - lost track of how many - one would break and I\u0027d buy another at Toys R Us. I had a floppy disk drive, monitor and a printer. Wrote a rudimentary word processor that I used through my senior year of college.\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003EA Timex Sinclair 1000\u003C/b\u003E with 3Kb of memory. I used a cassette tape recorder to save and load programs. It used BASIC as it\u0027s native operating system.\u003C/li\u003E\n\u003Cli\u003EMy introduction to computer programming was in the Army, about six months before my discharge. I was working as the Brigade Draftsman and shared an office with the \u003Cb\u003EIBM 1500 Minicomputer\u003C/b\u003E that was used to generate reports and run the data used in some of the brigade\u0027s war games. I was friends with the operator and I was able to get time regularly on the machine to get a good introduction to BASIC, which like many computers of that time was acting as the machine\u0027s operating system. Initially, programming looked a lot like math to me and I really didn\u0027t thinks I would like it, but once I got the gist of it, it became a life-long obsession. I was hooked.\u003C/li\u003E\n\u003Cul\u003E"
  },
  {
    "LanguageEntryId": 1,
    "Name": "JavaScript",
    "Key": "javascript",
    "BaseYear": 1997,
    "IsEstimate": true,
    "Text": "JavaScript was my hands-down favorite language for web development. I used it on  a daily basis since the late 90s and I still haven\u0027t found anything that comes close. It supports object-oriented programming, allows variables to hold pretty much anything and handles arrays in ways that truly inspires weird and wonderful things. Using JavaScript to make AJAX calls and dynamically update portions of the page is one of my favorite techniques. Add JQuery and JSON into the mix, and nearly anything is possible."
  },
  {
    "LanguageEntryId": 3,
    "Name": "ASP (Classic)",
    "Key": "asp",
    "BaseYear": 1998,
    "IsEstimate": true,
    "Text": "I have been using ASP since the late 90s. Even though it\u0027s an older technology, it still shows up every now an then, usually in some legacy application that have matured and is stable enough that no one has been able to make a convincing case to management that it needs to be replaced. My experience with it is as follows:\n\u003Cul\u003E\n\u003Cli\u003E\u003Cb\u003ECorillian Corporation (2000-2004)\u003C/b\u003E\u003Cbr\u003E\nThe bulk of all their online banking sites at this time were ASP coupled with COM objects written  in VB6 or maybe C\u002B\u002B (Not real sure as these were written by another group). There was also a custom version of Basic that was used for the host scripts that pulled data from the banks\u0027 hosts (usually mainframes). I eventually moved into a group that created banking sites for smaller banks and credit unions where the focus was to get the sites done quickly to keep the cost down. These sites were still in ASP but used JScript as the back-end language which I preferred over VBScript that is normally the default.\n\u003C/li\u003E\n\u003Cli\u003E\u003Cb\u003EInnovation Asset Group (IAG) (2004-2014)\u003C/b\u003E\u003Cbr\u003E\nIAG was a startup based in Lake Oswego when I joined the company. As a small company, we had at most 3-4 developers and at some points I was the only developer on the client side. Their main product, Decipher was an ASP-based web application that tracked patent, trademark and invention disclosure data. It had a data layer and a valuation layer, both written in VB.Net which ran as windows services using a third-party wrapper (at that point VB.Net did not support running as a service natively). The initial version used VBScript as the client-side language, which limited the browser it could be used with to IE6. \n\u003Cspace\u003E\nA rewrite several years later switched it to JavaScript and most of the pages used JScript in the back-end as well. JQuery and AJAX were used extensively throughout the application using an efficient custom serialization of the table data using the binary characters 1, 2 and 3 to separate table, row and field data respectively. Pages were rendered in the client, usually using an object that contained an array of rows, which in turn objects that contain an array of fields plus the logic to render the rows. The parent object would render the table and iterate through the objects which would render the rows.\n\u003Cspace\u003E\nI also created an extensive set of debugging and configuration tools that allowed uses to configure the application, add data fields and modify some screens as well as display in-memory data in tabular format. All this was based on user/group permissions.  \n\u003Cspace\u003E\nAt one point, the developers who wrote and managed the data and valuation layers left the company and it was decided to replace the aging VB.Net components with a new back-end based on a Tomcat server and Java. I was responsible for the client side and used AJAX to make REST calls to the back-end.   \n\u003C/li\u003E\n\u003C/ul\u003E"
  },
  {
    "LanguageEntryId": 9,
    "Name": "SQL",
    "Key": "sql",
    "BaseYear": 1998,
    "IsEstimate": false,
    "Text": "Not sure exactly when I started using SQL. I know it was probably around 1998 as I was still in California doing development on a Linux server for some local websites. At that time I was doing a lot of PHP/MySQL.\n\u003Cspace\u003E\nSQL has been a staple part of my development from the day I picked it up. I must have written thousands of queries to explore databases, create test data, test program execution and check results, even when I\u0027m using Entity Framework for my actual development. Professionally, I\u0027ve used it all through my career:\n\u003Cul\u003E\u003Cli\u003E\nWhen I went to work at \u003Cb\u003ECorillian\u003C/b\u003E in 2000, I wrote a lot of scripts against Microsoft SQL Server databases, mostly to support development. \n\u003C/li\u003E\u003Cli\u003E\nAt \u003Cb\u003EInnovation Asset Group\u003C/b\u003E (IAG) the emphasis was to write generic scripts that would work on both MySQL and MS Server as the main product, Decipher, could be installed to use either database engine. IAG didn\u0027t have a dedicated DB Analyst, so I ended up doing a lot of database installs and configuration, not to mention finding ways to optimize queries for both SQL Server \u003Ci\u003Eand\u003C/i\u003E MySQL.\n\u003C/li\u003E\u003Cli\u003E\n\u003Cb\u003EGenesis\u003C/b\u003E was already using Entity Framework in their main applications, but there was still a lot of SQL in the utility applications.\n\u003C/li\u003E\u003Cli\u003E\nAt \u003Cb\u003EMerrill Corporation\u003C/b\u003E I created and edited a lot of stored procedures which were used in the legacy product and the file interfaces to pull data from customer-provided text files and save it to the database. The product dealt with large volumes of insurance data and I often had to find ways to optimize the stored procedures to improve performance.\n\u003C/li\u003E\u003Cli\u003E\n\u003Cb\u003ESWBC\u003C/b\u003E used stored procedures in their APIs and some of the legacy applications used SQL with parameterized queries. I created, edited and debugged these stored procedures on a daily basis. \n\u003C/li\u003E\u003C/ol\u003E\n"
  },
  {
    "LanguageEntryId": 2,
    "Name": "C#",
    "Key": "c",
    "BaseYear": 2002,
    "IsEstimate": true,
    "Text": "I first learned C on the Amiga, and once \u0022I got it\u0022 (it took a class at Sun Micorsystems before I really understood pointers), I was hooked. I did some C on Sun workstations at McDonnell Douglas – the Interleaf Publish System used LISP as it\u0027s scripting language (don\u0027t get me started on LISP) and all I learned in LISP was how to write a function to call a C program. After that, I made all my scripts in C. When I moved to Windows, however, C and the MFC was just to involved for what I needed it for, so I moved to other languages like Visual Basic, JavaScript, PERL and PHP."
  },
  {
    "LanguageEntryId": 4,
    "Name": "AJAX",
    "Key": "ajax",
    "BaseYear": 2006,
    "IsEstimate": true,
    "Text": "AJAX (Asynchronous JavaScript And Xml) has actually lived up to all the hype it recieved. It basically takes advantage of the XML DOM\u0027s abilty to load external files through HTTP. In practical terms, you can write a client-side function that pulls data from a server without making a round-trip to the server. (Actually it does make a round trip, but as far as your web page is concerned, it was a client-side call).\n\u003Cp\u003E\nThe name is actually a bit deceptive. AJAX is an acronym for Asynchronous Javascript And XML, however AJAX calls do not have to be asynchronous (your code does not wait for the result), nor does it have to return XML, and it can be done in a language other than JavaScript – I originally used the technique in server-side VB at Corillian to retrieve check images and online banking statements via SOAP calls over a VPN. "
  },
  {
    "LanguageEntryId": 7,
    "Name": "Entity Framework (EF)",
    "Key": "ef",
    "BaseYear": 2014,
    "IsEstimate": false,
    "Text": "First exposed to Entity Framework (EF) when I worked at Genesys "
  },
  {
    "LanguageEntryId": 6,
    "Name": "TypeScript",
    "Key": "typescript",
    "BaseYear": 2016,
    "IsEstimate": false,
    "Text": "I did quite a bit of TypeScript development during my time at \u003Cb\u003ESouthwest Business Corporation\u003C/b\u003E (SWBC)\n\u003Cul\u003E\n\u003Cli\u003E\nThe main SWBC development group in San Antonio, Texas uplifted their legacy applications to a new set of applications (Portal) using .Net MVC/WebAPI on the back-end and Angular 4 for the UI which uses TypeScript. The application used MVC to build the pages and load the initial data which was serialized as part of the HTML. Once the page was built, the Angular/TypeScript took over and handled user request, using Angular\u0027s AJAX methods to call the WebAPI, which in turn performed any server-side operations that were needed then either navigated to another page through MVC or returned JSON back to the client and Angular would decide what to do next. I was involved in implementing the application maintained by the Portland team* as part of the Portal application.\n\u003C/li\u003E\n\u003Cli\u003E\nThe development team for the Portland Call Center began a project to uplift their product, SureTrack from ASP.Net to .Net Core MVC. This did not use Angular, but it \u003Ci\u003Edid\u003C/i\u003E use TypeScript and I did a lot of the client-side development. This was an interesting project as it gave me a chance to use TypeScript outside the Angular environment. I wrote several basic components including a tab control and a grid control. Unfortunately, in October, 2019, the Portland Call Center was closed and the project abandoned. The development team was retained as remote employees, but moved on to other projects in support of the San Antonio Team.\n\u003C/li\u003E\n\u003C/ul\u003E\nI have mixed feelings about TypeScript. It \u003Ci\u003Eseems\u003C/i\u003E like it\u0027s aimed at C#/Java developers that can\u0027t get their heads around the prototypical inheritance model that JavaScript uses. However, coming from JavaScript development, it feels a bit like learning German to write documentation in German so it can be translated back to my native English. I worry that it will lead to a generation of web developers that understand TypeScript, but don\u0027t understand the nuts and bolts of JavaScript. It\u0027s the quirks in JavaScript that really gives it it\u0027s power.\n\u003Cspace\u003E\nOn the other had, it does make for some elegant source code (yes, JavaScript in the wrong hands can lead to some marvelously undecipherable code), and developers familiar with C#/Java will have a much easier time figuring it out.\n"
  },
  {
    "LanguageEntryId": 5,
    "Name": "Blazor",
    "Key": "blazor",
    "BaseYear": 2020,
    "IsEstimate": false,
    "Text": "The latest language I\u0027ve picked up"
  }
]